package com.ynb.zarTasks;

/**
 *  Задание 9.15 Напишите класс, который принимает с клавиатуры целое число, которое должно означать порядковый номер месяца.
 *  В случае если полученное значение действительно соответствует порядковому номеру одного из месяцев,
 *  следует вывести сезон (лето, осень, зима, весна), к которому относится месяц. В случае если введенное значение
 *  не является порядковым номером месяца, следует вывести на экран соответствующее текстовое сообщение.
 */

public class Zar_task_9_15 {
    public static void main(String[] args) {

    }
}
