package com.ynb.zarTasks;

/**
 *Задание 9.14 Определим «текстовую форму оценки» следующим образом: 1 или 2 -«неудовлетворительно», 3  -«удовлетворительно»,
 *  4  -«хорошо», 5  -«ОТЛИЧНО». Напишите класс, который принимает с клавиатуры целое число и, если оно соответствует оценке,
 *  выводит на экран соответствующую «текстовую форму оценки». В случае если число не является оценкой, следует вывести на
 *  экран соответствующее текстовое сообщение.
 */

public class Zar_task_9_14 {
    public static void main(String[] args) {

    }
}
