package com.ynb.zarTasks;

/**
 * Задание 9.7 (отличная задача на все знание про if)
 * <p>
 * Напишите класс, который принимает с клавиатуры два числа, которые должны быть значениями двух нижних (у основания) углов в треугольнике.
 * Класс должен определять, о каком из следующих типов треугольников идет речь: остроугольный, тупоугольный, прямоугольный, равнобедренный,
 * равно сторонний (возможно, что треугольник относится сразу к двум типам).  В случае если введенные с клавиатуры данные (или хотя бы одно из них)
 * не могут быть углами треугольника, следует вывести на экран сообщение Ошибочные данные.
 * <p>
 * PS. сума углов треугольника равна 180 градусов. тупоугольный если нижний угол больше 90 градусов, остроугольный - каждый нижний меньше 90 градусов,
 * равнобедренный если 2 угла равны, равносторонний если все углы равны.
 */

public class Zar_task_9_7 {
    public static void main(String[] args) {

    }
}
