package com.ynb.zarTasks;

/**
 * Задание 9.5* (тут вродь как без составного ифа, но задачка со звездочеойю. На пошевелить мозгами)
 *  На каждом этаже многоэтажного дома расположены три квартиры; счет квартир идет слева направо.
 *  Например, на первом этаже квартира No 1 расположена слева, квартира No 2  -в центре, квартира No 3 - справа,
 *  и так далее. Напишите класс, который принимает с клавиатуры номер квартиры и выводит на экран следующую
 *  информацию: на каком этаже она расположе на, и какое место (слева, справа или в центре) она занимает на этом этаже.
 */

public class Zar_task_9_5 {
    public static void main(String[] args) {

    }
}
