package com.ynb.zarTasks;

/**
 * Задание 9.16 int а; a=in. nextint(); if (а<=0 11 а>=13) System.out.println("Этo не месяц"); if (а==12 11 a==l 11 а==2) System.out.println("Зимa");
 * if (а>=3 && a<=S) System.out.println("Becнa"); if (а>=б && а<=8) System.out.println("Лeтo"); if (а>=9 && а<=11) System. out. println( "Осень");
 * Определим следующие периоды в течение суток: утро -с 6 (включая) до 10 (не включая) часов, день -с 10 (не включая) до 18 (включая},
 * вечер -с 18 (не включая) до 22 (включая}, ночь -с 22 (не включая) до 6 часов следующего дня (не включая). Напишите класс,
 * который принимает с клавиатуры целое число, которое должно указывать на определенный час в сутках, и выводит на эк ран сообщение,
 * к какому периоду в сутках этот час относится. В случае если введенное значение не позволяет выполнить указанное действие,
 * следует вывести на экран соответствующее текстовое сообщение.
 */

public class Zar_task_9_16 {
    public static void main(String[] args) {

    }
}
