package com.ynb.zarTaskLoop;

import java.util.Scanner;

/**
 * Задание 12.2  Напишите класс, который принимает с клавиатуры 15 целых чисел и
 * выводит на экран информацию о том, сколько из них были четными и сколько нечетными.
 * ПС если хочешь не вводить вручную, есть лайфхаки,
 */


public class Zar_task_12_4 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println(" how match we do: ");
        int quantity = scanner.nextInt();

    }
}
