package com.ynb.lesons_0;

/*  Задача 1.1.1 (есть в учебнике, тема 1).
 *      Создайте новый проект и запустите в main распечатку
 */

public class LesExam_0 {
    public static void main(String[] args) {
        System.out.printf("new prgjkt");
    }
}
