package com.ynb.zarArrays;

import java.util.Random;
import java.util.Scanner;

/**
 * Задание 18.12 Напишите класс, который заполняет случайными трехзначными чис­лами массив,
 * размер которого при инициализации вводится с кла­виатуры. После заполнения класс должен
 * вывести на экран значения массива в одной строке, начиная с «начала» массива (с первой ячейки).
 */
public class Arr18_12 {
    public static void main(String[] args) {

/*        Scanner scanner = new Scanner(System.in);
        System.out.println(" write size arr");

        Random random = new Random();

        int[] numArr = new int[scanner.nextInt()];

        for (int i = 0; i < numArr.length; i++) {

            numArr[i] = random.nextInt(100, 999);
            System.out.println(i + ": " + numArr[i] + " ");

        }
    }
}*/

/*        Scanner scan = new Scanner(System.in);
        System.out.println("size of array? ");

        Random ran = new Random();

        int[] array = new int[scan.nextInt()];       //        int sizeOfArray  = scan.nextInt();


        for (int i = 0; i < array.length; i++) {

            array[i] = ran.nextInt(100, 999); // array[i] - обращение к массиву, что в него кладем!!!!!!!!!!!!!!!!!!
            System.out.print(i + "; " + array[i] + " ");

        }

    }
}*/
    }

}