package com.ynb.zarArrays;

/**
 * Задание 18.14 Напишите класс, который заполняет случайными трехзначными числами массив,
 * размер которого при инициализации вводится с клавиатуры. После заполнения класс должен
 * вывести на экран значения массива следующим образом:
 * • в первой строке -первую половину массива;
 * • во второй строке -вторую половину массива. В случае если массив имеет нечетный размер,
 * центральную ячейку следует выводить в первой строке.
 */

public class Arr18_14 {
    public static void main(String[] args) {


    }
}
